tdd_spec_capybara_cucumber/i-rock/app/controllers/achievements_controller.rb

INSERT INTO "achievements" ("title", "description", "featured", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["featured", "f"], ["created_at", "2016-03-23 07:55:52.111135"], ["updated_at", "2016-03-23 07:55:52.111135"]]
---
  def create
    @achievement = Achievement.new(achievement_params)
    if @achievement.save

UPDATE "achievements" SET "title" = ?, "updated_at" = ? WHERE "achievements"."id" = ?  [["title", "New Title"], ["updated_at", "2016-03-24 09:32:31.464608"], ["id", 1]]
---
  def update
    if @achievement.update_attributes(achievement_params)

SELECT  "achievements".* FROM "achievements" WHERE "achievements"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @achievement = Achievement.find(params[:id])

DELETE FROM "achievements" WHERE "achievements"."id" = ?  [["id", 1]]
---
  def destroy
    @achievement.destroy